## Q1. List any five functions of the pandas library with execution.


## Pandas read_csv() Function:	This function is used to retrieve data from CSV files in the form of a dataframe.
## Pandas head() Function:	This function is used to return the top n (5 by default) values of a data frame or series.
## Pandas tail() Function:	This method is used to return the bottom n (5 by default) rows of a data frame or series.
## Pandas sample() Function:	This method is used to generate a sample random row or column from the data frame.
## Pandas info() Function:	This method is used to generate the summary of the DataFrame, this will include info about columns with their names, their datatypes, and missing values

In [1]:
import pandas as pd

In [3]:
pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [5]:
df=pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [6]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [8]:
df.sample()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
577,578,1,1,"Silvey, Mrs. William Baird (Alice Munger)",female,39.0,1,0,13507,55.9,E44,S

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

## Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [46]:
import pandas as pd

data = { 
    'A': ['Alice', 'Bob', 'Claire','baroda','kotak','mahindra'],
    'B' :[ 25,30,27,34,76,21],
    'C' :['Female', 'Male', 'Female','male','female','male']
}

df2= pd.DataFrame(data)
print(df2)

          A   B       C
0     Alice  25  Female
1       Bob  30    Male
2    Claire  27  Female
3    baroda  34    male
4     kotak  76  female
5  mahindra  21    male

In [47]:
df2[['A','B','C']][1:6:2]

          A   B     C
1       Bob  30  Male
3    baroda  34  male
5  mahindra  21  male

## Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.
## For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.

In [48]:
# Create DataFrame
import pandas as pd
studentdetails = {
       "student_name":["Ram","Sam","Scott","Ann","John"],
       "mathematics" :[80,90,85,70,95],
       "science" :[85,95,80,90,75],
       "english" :[90,85,80,70,95]
              }
index_labels=['r1','r2','r3','r4','r5']
df3 = pd.DataFrame(studentdetails ,index=index_labels)
print("Create DataFrame:\n", df3)

Create DataFrame:
    student_name  mathematics  science  english
r1          Ram           80       85       90
r2          Sam           90       95       85
r3        Scott           85       80       80
r4          Ann           70       90       70
r5         John           95       75       95

In [49]:
sum=df3.loc[['r1','r2','r3']].sum()

In [50]:
print(sum)

student_name    RamSamScott
mathematics             255
science                 260
english                 255
dtype: object

## Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column'Word_Count' that contains the number of words in each row of the 'Text' column.

In [51]:
# Create DataFrame
import pandas as pd
details = {
       "Text":["Ram sham","Sam pande ","Scott","Ann jadav","John"],
              }
index_labels=['r1','r2','r3','r4','r5']
df4 = pd.DataFrame(details ,index=index_labels)
print("Create DataFrame:\n", df4)

Create DataFrame:
           Text
r1    Ram sham
r2  Sam pande
r3       Scott
r4   Ann jadav
r5        John

In [52]:
df4.head()

          Text
r1    Ram sham
r2  Sam pande
r3       Scott
r4   Ann jadav
r5        John

In [53]:
df4["Word_Count"] = df4["Text"].apply(lambda n: len(n.split()))
print(df4.head())

          Text  Word_Count
r1    Ram sham           2
r2  Sam pande            2
r3       Scott           1
r4   Ann jadav           2
r5        John           1

In [54]:
df4['Word_Count'] = df4['Text'].str.split().str.len()

In [55]:
print(df4.head())

          Text  Word_Count
r1    Ram sham           2
r2  Sam pande            2
r3       Scott           1
r4   Ann jadav           2
r5        John           1

## Q5. How are DataFrame.size() and DataFrame.shape() different?

## Pandas Size Function
## The size property is used to get an int representing the number of elements in this object and Return the number of rows if Series. Otherwise, return the number of rows times the number of columns if DataFrame.

## Syntax: dataframe.size
## Return : Returns size of dataframe/series which is equivalent to total number of elements. That is rows x columns.

 ## Pandas Shape Function
## The shape property is used to get a tuple representing the dimensionality of the Pandas DataFrame.

## Syntax: dataframe.shape
## Return : Returns tuple of shape (Rows, columns) of dataframe/series

In [58]:
## by using above data 
import pandas as pd

size = df4.size
 
# printing size 
print("Size = {}".format(size))

Size = 10

In [59]:

shape = df4.shape

# printing shape
print("Shape = {}".format(shape))

Shape = (5, 2)

## Q6. Which function of pandas do we use to read an excel file?

## Read an Excel file into a pandas DataFrame . Supports xls , xlsx , xlsm , xlsb , odf , ods and odt file extensions read from a local filesystem or URL.

## Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address. The username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username' column.

In [70]:
# Create DataFrame
import pandas as pd
emaildetails = {
       "Email":["Ram.k@gmail.com","Sam012@gmail.com","Scott.h@gmail.com","Ann.r@gmail.com","John.0909@gmail.com"],
    
              }
index_labels=['r1','r2','r3','r4','r5']
df5 = pd.DataFrame(emaildetails ,index=index_labels)
print("Create DataFrame:\n", df5)

Create DataFrame:
                   Email
r1      Ram.k@gmail.com
r2     Sam012@gmail.com
r3    Scott.h@gmail.com
r4      Ann.r@gmail.com
r5  John.0909@gmail.com

In [71]:
df5.head()

                  Email
r1      Ram.k@gmail.com
r2     Sam012@gmail.com
r3    Scott.h@gmail.com
r4      Ann.r@gmail.com
r5  John.0909@gmail.com

In [72]:

df5['Username'] = df5['Email'].str.split('@').str[0]
print (df5)

                  Email   Username
r1      Ram.k@gmail.com      Ram.k
r2     Sam012@gmail.com     Sam012
r3    Scott.h@gmail.com    Scott.h
r4      Ann.r@gmail.com      Ann.r
r5  John.0909@gmail.com  John.0909

## Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.

In [2]:
import pandas as pd
data={"A": [3,8,6,2,9],
      "B": [5,2,9,3,1],
      "C": [1,7,4,5,2]
    
}

In [3]:
df6= pd.DataFrame(data)
print(df6)

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [7]:
df6[(df6['A']>5) & (df6['B']<10)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

## Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [30]:

import pandas as pd 
data = {"Values":[5, 9, 8, 5, 7, 8, 1, 2, 3, 4, 5, 6, 7, 8, 9, 5, 3]} 
df7= pd.DataFrame(data)
print(df7)

    Values
0        5
1        9
2        8
3        5
4        7
5        8
6        1
7        2
8        3
9        4
10       5
11       6
12       7
13       8
14       9
15       5
16       3

In [34]:
df7['Values'].mean()

5.588235294117647

In [35]:
df7["Values"].std()

2.4509901960588234

In [36]:
df7['Values'].median()

5.0

## Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [4]:
import pandas as pd
data={
  "Date" :['2024-01-01','2024-01-02','2024-01-03' ,'2024-01-04' ,'2024-01-05' ,'2024-01-06', '2024-01-7','2024-01-8'] , 
   "Sales" :['18.34523','18.98076','18.12547','18.84501','18.10098','18.11114','18.76542','18.45639']
}
df8= pd.DataFrame(data)
print(df8)

         Date     Sales
0  2024-01-01  18.34523
1  2024-01-02  18.98076
2  2024-01-03  18.12547
3  2024-01-04  18.84501
4  2024-01-05  18.10098
5  2024-01-06  18.11114
6   2024-01-7  18.76542
7   2024-01-8  18.45639

In [5]:
df8['MovingAverage'] = df8.rolling(window=7).mean()

/tmp/ipykernel_95/1674019840.py:1: FutureWarning: Dropping of nuisance columns in rolling operations is deprecated; in a future version this will raise TypeError. Select only valid columns before calling the operation. Dropped columns were Index(['Date'], dtype='object')
  df8['MovingAverage'] = df8.rolling(window=7).mean()

In [6]:
df8

         Date     Sales  MovingAverage
0  2024-01-01  18.34523            NaN
1  2024-01-02  18.98076            NaN
2  2024-01-03  18.12547            NaN
3  2024-01-04  18.84501            NaN
4  2024-01-05  18.10098            NaN
5  2024-01-06  18.11114            NaN
6   2024-01-7  18.76542      18.467716
7   2024-01-8  18.45639      18.483596

## Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.

In [48]:
import pandas as pd


df9 = pd.DataFrame({'Date':[' 2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05']})
df9['Date'] = pd.to_datetime(df9['Date'])

In [49]:
df9.head()

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [45]:
df9['Weekday'] = df9['Date'].dt.day_name()

In [47]:
df9.head()

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday